<div class="row">
        <div class="col-lg-9">
            <h1>1204.Last Person to Fit in the Elevator</h1>
            <div class="markdown-body" style="margin-top: 20px">
                <p>Table: <code>Queue</code></p>

<pre>
+-------------+---------+
| Column Name | Type    |
+-------------+---------+
| person_id   | int     |
| person_name | varchar |
| weight      | int     |
| turn        | int     |
+-------------+---------+
person_id is the primary key column for this table.
This table has the information about all people waiting for an elevator.
The <code>person_id</code>&nbsp;and <code>turn</code> columns will contain all numbers from 1 to n, where n is the number of rows in the table.
</pre>

<p>&nbsp;</p>

<p>The maximum weight the elevator can hold is <strong>1000</strong>.</p>

<p>Write an SQL query to find the&nbsp;<code>person_name</code> of the last person who will fit in the elevator without exceeding the weight limit. It is guaranteed that the person who is&nbsp;first in the queue can fit in the elevator.</p>

<p>The query result format is in the following example:</p>

<pre>
Queue table
+-----------+-------------------+--------+------+
| person_id | person_name       | weight | turn |
+-----------+-------------------+--------+------+
| 5         | George Washington | 250    | 1    |
| 3         | John Adams        | 350    | 2    |
| 6         | Thomas Jefferson  | 400    | 3    |
| 2         | Will Johnliams    | 200    | 4    |
| 4         | Thomas Jefferson  | 175    | 5    |
| 1         | James Elephant    | 500    | 6    |
+-----------+-------------------+--------+------+

Result table
+-------------------+
| person_name       |
+-------------------+
| Thomas Jefferson  |
+-------------------+

Queue table is ordered by turn in the example for simplicity.
In the example George Washington(id 5), John Adams(id 3) and Thomas Jefferson(id 6) will enter the elevator as their weight sum is 250 + 350 + 400 = 1000.
Thomas Jefferson(id 6) is the last person to fit in the elevator because he has the last turn in these three people.
</pre>

In [1]:
import sqlalchemy
import pandas as pd
engine = sqlalchemy.create_engine('mysql+mysqlconnector://root:newpass_1234@localhost:3306/sys')

In [2]:
Queue = pd.read_sql_table("Queue", engine)
Queue

   person_id        person_name  weight  turn
0          5  George Washington     250     1
1          4   Thomas Jefferson     175     5
2          3         John Adams     350     2
3          6   Thomas Jefferson     400     3
4          1     James Elephant     500     6
5          2     Will Johnliams     200     4

In [3]:
query = '''
SELECT person_name
FROM (
SELECT *,
       SUM(weight) OVER (ORDER BY turn) total
FROM Queue) temp
WHERE total <= 1000
ORDER BY total DESC LIMIT 1;
'''
pd.read_sql_query(query, engine)

        person_name
0  Thomas Jefferson